org/20231128T172125--wsl-commands__wsl.org
#+title:      wsl commands
#+date:       [2023-11-28 Tue 17:21]
#+filetags:   :wsl:
#+identifier: 20231128T172125

https://learn.microsoft.com/en-us/windows/wsl/basic-commands

#+begin_src bash
  # list available linux distros
  wsl --list --online
  # install a default distro(which is ubuntu)
  wsl --install
  # View the list of distros and their current state:
  wsl.exe -l -v
  # Shutdown everything:
  wsl.exe --shutdown
  # Terminate a specific distro:
  wsl.exe -t <DistroName>
  # Boot up the default distro (marked with *):
  wsl.exe
  # Boot up a specific distro:
  wsl.exe -d <DistroName>
  # update wsl
  wsl --update
  # check wsl status
  wsl --status
  # check wsl version
  wsl --version
  # wsl help
  wsl --help
#+end_src
