html/20231128T172125--wsl-commands__wsl.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>wsl commands</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">16 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231128T172125--wsl-commands__wsl.html">wsl commands</a></h1>
<p>
<a href="https://learn.microsoft.com/en-us/windows/wsl/basic-commands">https://learn.microsoft.com/en-us/windows/wsl/basic-commands</a>
</p>

<div class="org-src-container">
<pre class="src src-bash"># list available linux distros
wsl --list --online
# install a default distro(which is ubuntu)
wsl --install
# View the list of distros and their current state:
wsl.exe -l -v
# Shutdown everything:
wsl.exe --shutdown
# Terminate a specific distro:
wsl.exe -t &lt;DistroName&gt;
# Boot up the default distro (marked with *):
wsl.exe
# Boot up a specific distro:
wsl.exe -d &lt;DistroName&gt;
# update wsl
wsl --update
# check wsl status
wsl --status
# check wsl version
wsl --version
# wsl help
wsl --help
</pre>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-wsl.html">wsl</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
